In [1]:
import pandas as pd
import numpy as np
pd.set_option('max_columns', 8, 'max_rows', 10, 'max_colwidth', 12)
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

# 인덱스 정렬

## 인덱스 객체 검사

In [3]:
# 칼럼만 추출
college = pd.read_csv('college.csv')
columns = college.columns
columns

Index(['INSTNM', 'CITY', 'STABBR', 'HBCU', 'MENONLY', 'WOMENONLY', 'RELAFFIL',
       'SATVRMID', 'SATMTMID', 'DISTANCEONLY', 'UGDS', 'UGDS_WHITE',
       'UGDS_BLACK', 'UGDS_HISP', 'UGDS_ASIAN', 'UGDS_AIAN', 'UGDS_NHPI',
       'UGDS_2MOR', 'UGDS_NRA', 'UGDS_UNKN', 'PPTUG_EF', 'CURROPER', 'PCTPELL',
       'PCTFLOAN', 'UG25ABV', 'MD_EARN_WNE_P10', 'GRAD_DEBT_MDN_SUPP'],
      dtype='object')

In [5]:
# array
columns.values

array(['INSTNM', 'CITY', 'STABBR', 'HBCU', 'MENONLY', 'WOMENONLY',
       'RELAFFIL', 'SATVRMID', 'SATMTMID', 'DISTANCEONLY', 'UGDS',
       'UGDS_WHITE', 'UGDS_BLACK', 'UGDS_HISP', 'UGDS_ASIAN', 'UGDS_AIAN',
       'UGDS_NHPI', 'UGDS_2MOR', 'UGDS_NRA', 'UGDS_UNKN', 'PPTUG_EF',
       'CURROPER', 'PCTPELL', 'PCTFLOAN', 'UG25ABV', 'MD_EARN_WNE_P10',
       'GRAD_DEBT_MDN_SUPP'], dtype=object)

In [6]:
columns[5]

'WOMENONLY'

In [7]:
columns[[1,8,10]]

Index(['CITY', 'SATMTMID', 'UGDS'], dtype='object')

In [8]:
columns[-7:-4]

Index(['PPTUG_EF', 'CURROPER', 'PCTPELL'], dtype='object')

In [9]:
columns.min(), columns.max(), columns.isnull().sum()

('CITY', 'WOMENONLY', 0)

In [10]:
columns + '_A'

Index(['INSTNM_A', 'CITY_A', 'STABBR_A', 'HBCU_A', 'MENONLY_A', 'WOMENONLY_A',
       'RELAFFIL_A', 'SATVRMID_A', 'SATMTMID_A', 'DISTANCEONLY_A', 'UGDS_A',
       'UGDS_WHITE_A', 'UGDS_BLACK_A', 'UGDS_HISP_A', 'UGDS_ASIAN_A',
       'UGDS_AIAN_A', 'UGDS_NHPI_A', 'UGDS_2MOR_A', 'UGDS_NRA_A',
       'UGDS_UNKN_A', 'PPTUG_EF_A', 'CURROPER_A', 'PCTPELL_A', 'PCTFLOAN_A',
       'UG25ABV_A', 'MD_EARN_WNE_P10_A', 'GRAD_DEBT_MDN_SUPP_A'],
      dtype='object')

In [11]:
columns > 'G'

array([ True, False,  True,  True,  True,  True,  True,  True,  True,
       False,  True,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True, False,  True,  True,  True,  True,  True])

In [12]:
# 변경은 불가
columns[1] = 'city'

TypeError: Index does not support mutable operations

In [ ]:
c1 = columns[:4]
c2 = columns[2:6]
c1.union(c2) # or `c1 | c2`

In [13]:
# 대칭차집합
c1.symmetric_difference(c2) # or `c1 ^ c2`

NameError: name 'c1' is not defined

## 카디션 곱 생성

In [14]:
s1 = pd.Series(index=list('aaab'), data=np.arange(4))
s1

a    0
a    1
a    2
b    3
dtype: int32

In [15]:
s2 = pd.Series(index=list('cababb'), data=np.arange(6))
s2

c    0
a    1
b    2
a    3
b    4
b    5
dtype: int32

In [16]:
# s1의 a와 s2의 a가 쌍을 이루어 더하기 연산
# a : 0+1, 0+3, 1+1, 1+3, 2+1, 2+3
s1 + s2

a    1.0
a    3.0
a    2.0
a    4.0
a    3.0
a    5.0
b    5.0
b    7.0
b    8.0
c    NaN
dtype: float64

In [17]:
s1 = pd.Series(index=list('aaabb'), data=np.arange(5))
s2 = pd.Series(index=list('bbaaa'), data=np.arange(5))
s1 + s2

a    2
a    3
a    4
a    3
a    4
    ..
a    6
b    3
b    4
b    4
b    5
Length: 13, dtype: int32

In [18]:
# Series의 index의 값과 순서가 모두 동일한 경우 카디션 곱은 생성되지 않는다.
s1 = pd.Series(index=list('aaabb'), data=np.arange(5))
s2 = pd.Series(index=list('aaabb'), data=np.arange(5))
s1 + s2

a    0
a    2
a    4
b    6
b    8
dtype: int32

In [19]:
# 중복이 없는 값 두개도 카디션 곱은 생성X
s3 = pd.Series(index=list('ab'), data=np.arange(2))
s4 = pd.Series(index=list('ba'), data=np.arange(2))
s3 + s4

a    1
b    1
dtype: int32

## 인덱스 폭발

In [20]:
employee = pd.read_csv('employee.csv', index_col='RACE')
employee.head()

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,...,GENDER,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE
RACE,,,,,,,,,
Hispanic/Latino,0,ASSISTAN...,Municipa...,121862.0,...,Female,Active,2006-06-12,2012-10-13
Hispanic/Latino,1,LIBRARY ...,Library,26125.0,...,Female,Active,2000-07-19,2010-09-18
White,2,POLICE O...,Houston ...,45279.0,...,Male,Active,2015-02-03,2015-02-03
White,3,ENGINEER...,Houston ...,63166.0,...,Male,Active,1982-02-08,1991-05-25
White,4,ELECTRICIAN,General ...,56347.0,...,Male,Active,1989-06-19,1994-10-22

In [21]:
salary1 = employee['BASE_SALARY']
salary2 = employee['BASE_SALARY']
salary1 is salary2

True

In [22]:
# copy() : 리스트의 위치를 참조하여 가져오는 것
salary2 = employee['BASE_SALARY'].copy()
salary1 is salary2

False

In [143]:
# 고유 id가 다르기 때문에 False
id(salary1)

1942363995344

In [144]:
id(salary2)

1942364241680

In [23]:
salary1 = salary1.sort_index()
salary1.head()

RACE
American Indian or Alaskan Native    78355.0
American Indian or Alaskan Native    26125.0
American Indian or Alaskan Native    98536.0
American Indian or Alaskan Native        NaN
American Indian or Alaskan Native    55461.0
Name: BASE_SALARY, dtype: float64

In [24]:
salary2.head()

RACE
Hispanic/Latino    121862.0
Hispanic/Latino     26125.0
White               45279.0
White               63166.0
White               56347.0
Name: BASE_SALARY, dtype: float64

In [25]:
salary_add = salary1 + salary2
salary_add1 = salary1 + salary1
len(salary1), len(salary2), len(salary_add), len(salary_add1)

(2000, 2000, 1175424, 2000)

In [26]:
index_vc = salary1.index.value_counts(dropna=False)
index_vc

Black or African American            700
White                                665
Hispanic/Latino                      480
Asian/Pacific Islander               107
NaN                                   35
American Indian or Alaskan Native     11
Others                                 2
Name: RACE, dtype: int64

In [27]:
# 모든 객체의 수를 제곱해서 더하면
# salary_add 객체 수를 알 수있다
index_vc.pow(2).sum()

1175424

## 동일하지 않은 인덱스로 값 채우기

In [28]:
baseball_14 = pd.read_csv('baseball14.csv',
   index_col='playerID')
baseball_15 = pd.read_csv('baseball15.csv',
   index_col='playerID')
baseball_16 = pd.read_csv('baseball16.csv',
   index_col='playerID')
baseball_14.head()

           yearID  stint teamID lgID  ...  HBP   SH   SF  GIDP
playerID                              ...
altuvjo01    2014      1    HOU   AL  ...  5.0  1.0  5.0  20.0
cartech02    2014      1    HOU   AL  ...  5.0  0.0  4.0  12.0
castrja01    2014      1    HOU   AL  ...  9.0  1.0  3.0  11.0
corpoca01    2014      1    HOU   AL  ...  3.0  1.0  2.0   3.0
dominma01    2014      1    HOU   AL  ...  5.0  2.0  7.0  23.0

[5 rows x 21 columns]

In [29]:
# 차집합
baseball_14.index.difference(baseball_15.index)

Index(['corpoca01', 'dominma01', 'fowlede01', 'grossro01', 'guzmaje01',
       'hoeslj01', 'krausma01', 'preslal01', 'singljo02'],
      dtype='object', name='playerID')

In [30]:
baseball_14.index.difference(baseball_16.index)

Index(['cartech02', 'corpoca01', 'dominma01', 'fowlede01', 'grossro01',
       'guzmaje01', 'hoeslj01', 'krausma01', 'preslal01', 'singljo02',
       'villajo01'],
      dtype='object', name='playerID')

In [31]:
hits_14 = baseball_14['H']
hits_15 = baseball_15['H']
hits_16 = baseball_16['H']
hits_14.head()

playerID
altuvjo01    225
cartech02    115
castrja01    103
corpoca01     40
dominma01    121
Name: H, dtype: int64

In [32]:
(hits_14 + hits_15).head()

playerID
altuvjo01    425.0
cartech02    193.0
castrja01    174.0
congeha01      NaN
corpoca01      NaN
Name: H, dtype: float64

In [33]:
# fill_value : 서로 일치하지 않는 인덱스의 값을 0으로 설정
# 다른 값으로도 가능 알맞은 값을 찾아서 설정하자
hits_14.add(hits_15, fill_value=0).head()

playerID
altuvjo01    425.0
cartech02    193.0
castrja01    174.0
congeha01     46.0
corpoca01     40.0
Name: H, dtype: float64

In [34]:
hits_total = (hits_14
   .add(hits_15, fill_value=0)
   .add(hits_16, fill_value=0)
)
hits_total.head()

playerID
altuvjo01    641.0
bregmal01     53.0
cartech02    193.0
castrja01    243.0
congeha01     46.0
Name: H, dtype: float64

In [35]:
# NaN값이 하나라도 있으면 True
hits_total.hasnans

False

In [36]:
df_14 = baseball_14[['G','AB', 'R', 'H']]
df_14.head()

             G   AB   R    H
playerID
altuvjo01  158  660  85  225
cartech02  145  507  68  115
castrja01  126  465  43  103
corpoca01   55  170  22   40
dominma01  157  564  51  121

In [37]:
df_15 = baseball_15[['AB', 'R', 'H', 'HR']]
df_15.head()

            AB   R    H  HR
playerID
altuvjo01  638  86  200  15
cartech02  391  50   78  24
castrja01  337  38   71  11
congeha01  201  25   46  11
correca01  387  52  108  22

In [38]:
# NaN값의 데이터
(df_14 + df_15).head(10).style.highlight_null('yellow')

In [39]:
(df_14
.add(df_15, fill_value=0)
.head(10)
.style.highlight_null('yellow')
)

## 다른 DataFrame의 열 더하기

In [40]:
employee = pd.read_csv('employee.csv')
dept_sal = employee[['DEPARTMENT', 'BASE_SALARY']]

In [41]:
# DEPARTMENT는 오름차순, BASE_SALARY는 내림차순
dept_sal = dept_sal.sort_values(['DEPARTMENT', 'BASE_SALARY'],
    ascending=[True, False])

In [42]:
# drop_duplicates : 중복데이터 drop
max_dept_sal = dept_sal.drop_duplicates(subset='DEPARTMENT')
max_dept_sal.head()

       DEPARTMENT  BASE_SALARY
1494  Admn. & ...     140416.0
149   City Con...      64251.0
236   City Cou...     100000.0
647   Conventi...      38397.0
1500  Dept of ...      89221.0

In [43]:
# index를 DEPARTENT의 값들로
max_dept_sal = max_dept_sal.set_index('DEPARTMENT')
employee = employee.set_index('DEPARTMENT')

In [44]:
# assign을 통해 맨 뒤 칼럼을 MAX_DEPT_SALARY로 생성
employee = (employee
   .assign(MAX_DEPT_SALARY=max_dept_sal['BASE_SALARY'])
)
employee.head(3)

,UNIQUE_ID,POSITION_TITLE,BASE_SALARY,RACE,...,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE,MAX_DEPT_SALARY
DEPARTMENT,,,,,,,,,
Municipal Courts Department,0,ASSISTAN...,121862.0,Hispanic...,...,Active,2006-06-12,2012-10-13,121862.0
Library,1,LIBRARY ...,26125.0,Hispanic...,...,Active,2000-07-19,2010-09-18,107763.0
Houston Police Department-HPD,2,POLICE O...,45279.0,White,...,Active,2015-02-03,2015-02-03,199596.0

In [45]:
# query : 비교연산을 가능하게 해주는 매서드
employee.query('BASE_SALARY > MAX_DEPT_SALARY')

Empty DataFrame
Columns: [UNIQUE_ID, POSITION_TITLE, BASE_SALARY, RACE, EMPLOYMENT_TYPE, GENDER, EMPLOYMENT_STATUS, HIRE_DATE, JOB_DATE, MAX_DEPT_SALARY]
Index: []

[0 rows x 10 columns]

In [46]:
employee.query('BASE_SALARY >= MAX_DEPT_SALARY').head(3)

,UNIQUE_ID,POSITION_TITLE,BASE_SALARY,RACE,...,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE,MAX_DEPT_SALARY
DEPARTMENT,,,,,,,,,
Municipal Courts Department,0,ASSISTAN...,121862.0,Hispanic...,...,Active,2006-06-12,2012-10-13,121862.0
Health & Human Services,11,CHIEF PH...,180416.0,Black or...,...,Active,1987-05-22,1999-08-28,180416.0
City Controller's Office,149,ADMINIST...,64251.0,Hispanic...,...,Active,1990-12-11,2010-05-01,64251.0

In [70]:
# 중복데이터를 없애 카디션곱이 일어나지않게 하자
employee = pd.read_csv('employee.csv')
max_dept_sal = (employee
    [['DEPARTMENT', 'BASE_SALARY']]
    .sort_values(['DEPARTMENT', 'BASE_SALARY'],
        ascending=[True, False])
    .drop_duplicates(subset='DEPARTMENT')
    .set_index('DEPARTMENT')
)

In [78]:
employee_new =(employee
    .set_index('DEPARTMENT')
    .assign(MAX_DEPT_SALARY=max_dept_sal['BASE_SALARY'])
).head(3)
employee_new

,UNIQUE_ID,POSITION_TITLE,BASE_SALARY,RACE,...,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE,MAX_DEPT_SALARY
DEPARTMENT,,,,,,,,,
Municipal Courts Department,0,ASSISTAN...,121862.0,Hispanic...,...,Active,2006-06-12,2012-10-13,121862.0
Library,1,LIBRARY ...,26125.0,Hispanic...,...,Active,2000-07-19,2010-09-18,107763.0
Houston Police Department-HPD,2,POLICE O...,45279.0,White,...,Active,2015-02-03,2015-02-03,199596.0

In [76]:
# dept_sal = employee[['DEPARTMENT', 'BASE_SALARY']]
random_salary = (dept_sal
    .sample(n=10, random_state=42)
    .set_index('DEPARTMENT')
)
random_salary

              BASE_SALARY
DEPARTMENT
Public Wo...      34861.0
Houston A...      29286.0
Houston P...      31907.0
Houston P...      66614.0
Houston P...      42000.0
Houston P...      43443.0
Houston P...      66614.0
Public Wo...      52582.0
Finance           93168.0
Houston P...      35318.0

In [79]:
(employee
    .set_index('DEPARTMENT')
    .assign(MAX_SALARY2=max_dept_sal['BASE_SALARY'].head(3))
    .MAX_SALARY2
    .value_counts()
)

140416.0    29
100000.0    11
64251.0      5
Name: MAX_SALARY2, dtype: int64

In [83]:
# max()를 사용하면 groupby칼럼의 순서대로 출력
employee.groupby('DEPARTMENT').BASE_SALARY.max()

DEPARTMENT
Admn. & Regulatory Affairs        140416.0
City Controller's Office           64251.0
City Council                      100000.0
Convention and Entertainment       38397.0
Dept of Neighborhoods (DON)        89221.0
                                    ...
Municipal Courts Department       121862.0
Parks & Recreation                 85055.0
Planning & Development             68762.0
Public Works & Engineering-PWE    178331.0
Solid Waste Management            110005.0
Name: BASE_SALARY, Length: 24, dtype: float64

In [84]:
# transform을 사용하면 index가 유지된다.
employee.groupby('DEPARTMENT').BASE_SALARY.transform('max')

0       121862.0
1       107763.0
2       199596.0
3       210588.0
4        89194.0
          ...
1995    199596.0
1996    210588.0
1997    199596.0
1998    199596.0
1999    210588.0
Name: BASE_SALARY, Length: 2000, dtype: float64

In [80]:
max_sal = (employee
    .groupby('DEPARTMENT')
    .BASE_SALARY
    .transform('max')
)

In [81]:
# index가 유지되기 때문에 assign도 쉽게 가능
(employee
    .assign(MAX_DEPT_SALARY=max_sal)
)

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,...,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE,MAX_DEPT_SALARY
0,0,ASSISTAN...,Municipa...,121862.0,...,Active,2006-06-12,2012-10-13,121862.0
1,1,LIBRARY ...,Library,26125.0,...,Active,2000-07-19,2010-09-18,107763.0
2,2,POLICE O...,Houston ...,45279.0,...,Active,2015-02-03,2015-02-03,199596.0
3,3,ENGINEER...,Houston ...,63166.0,...,Active,1982-02-08,1991-05-25,210588.0
4,4,ELECTRICIAN,General ...,56347.0,...,Active,1989-06-19,1994-10-22,89194.0
...,...,...,...,...,...,...,...,...,...
1995,1995,POLICE O...,Houston ...,43443.0,...,Active,2014-06-09,2015-06-09,199596.0
1996,1996,COMMUNIC...,Houston ...,66523.0,...,Active,2003-09-02,2013-10-06,210588.0
1997,1997,POLICE O...,Houston ...,43443.0,...,Active,2014-10-13,2015-10-13,199596.0
1998,1998,POLICE O...,Houston ...,55461.0,...,Active,2009-01-20,2011-07-02,199596.0
1999,1999,FIRE FIG...,Houston ...,51194.0,...,Active,2009-01-12,2010-07-12,210588.0

In [85]:
max_sal = (employee
    .groupby('DEPARTMENT')
    .BASE_SALARY
    .max()
)

In [86]:
# index가 유지가 안되기 때문에 merge로 값을 맞춰야 한다.
(employee
    .merge(max_sal.rename('MAX_DEPT_SALARY'),
           how='left', left_on='DEPARTMENT',
           right_index=True)
)

,UNIQUE_ID,POSITION_TITLE,DEPARTMENT,BASE_SALARY,...,EMPLOYMENT_STATUS,HIRE_DATE,JOB_DATE,MAX_DEPT_SALARY
0,0,ASSISTAN...,Municipa...,121862.0,...,Active,2006-06-12,2012-10-13,121862.0
1,1,LIBRARY ...,Library,26125.0,...,Active,2000-07-19,2010-09-18,107763.0
2,2,POLICE O...,Houston ...,45279.0,...,Active,2015-02-03,2015-02-03,199596.0
3,3,ENGINEER...,Houston ...,63166.0,...,Active,1982-02-08,1991-05-25,210588.0
4,4,ELECTRICIAN,General ...,56347.0,...,Active,1989-06-19,1994-10-22,89194.0
...,...,...,...,...,...,...,...,...,...
1995,1995,POLICE O...,Houston ...,43443.0,...,Active,2014-06-09,2015-06-09,199596.0
1996,1996,COMMUNIC...,Houston ...,66523.0,...,Active,2003-09-02,2013-10-06,210588.0
1997,1997,POLICE O...,Houston ...,43443.0,...,Active,2014-10-13,2015-10-13,199596.0
1998,1998,POLICE O...,Houston ...,55461.0,...,Active,2009-01-20,2011-07-02,199596.0
1999,1999,FIRE FIG...,Houston ...,51194.0,...,Active,2009-01-12,2010-07-12,210588.0

## 각 열의 최댓값 강조

In [94]:
college = pd.read_csv('college.csv', index_col='INSTNM')
college.dtypes

CITY                   object
STABBR                 object
HBCU                  float64
MENONLY               float64
WOMENONLY             float64
                       ...
PCTPELL               float64
PCTFLOAN              float64
UG25ABV               float64
MD_EARN_WNE_P10        object
GRAD_DEBT_MDN_SUPP     object
Length: 26, dtype: object

In [89]:
college.MD_EARN_WNE_P10.sample(10, random_state=42)

INSTNM
Career Point College                                      20700
Ner Israel Rabbinical College                       PrivacyS...
Reflections Academy of Beauty                               NaN
Capital Area Technical College                            26400
West Virginia University Institute of Technology          43400
Mid-State Technical College                               32000
Strayer University-Huntsville Campus                      49200
National Aviation Academy of Tampa Bay                    45000
University of California-Santa Cruz                       43000
Lexington Theological Seminary                              NaN
Name: MD_EARN_WNE_P10, dtype: object

In [90]:
college.GRAD_DEBT_MDN_SUPP.sample(10, random_state=42)

INSTNM
Career Point College                                      14977
Ner Israel Rabbinical College                       PrivacyS...
Reflections Academy of Beauty                       PrivacyS...
Capital Area Technical College                      PrivacyS...
West Virginia University Institute of Technology          23969
Mid-State Technical College                                8025
Strayer University-Huntsville Campus                    36173.5
National Aviation Academy of Tampa Bay                    22778
University of California-Santa Cruz                       19884
Lexington Theological Seminary                      PrivacyS...
Name: GRAD_DEBT_MDN_SUPP, dtype: object

In [95]:
# NaN값 제외 count
college.MD_EARN_WNE_P10.value_counts()

PrivacySuppressed    822
38800                151
21500                 97
49200                 78
27400                 46
                    ...
84000                  1
66900                  1
52800                  1
67800                  1
186500                 1
Name: MD_EARN_WNE_P10, Length: 598, dtype: int64

In [98]:
# set으로 만들면 unique한 값만 뽑을 수 있다.
set(college.MD_EARN_WNE_P10.apply(type))

{float, str}

In [99]:
college.GRAD_DEBT_MDN_SUPP.value_counts()

PrivacySuppressed    1510
9500                  514
27000                 306
25827.5               136
25000                 124
                     ...
9604                    1
19262                   1
8099                    1
8050                    1
11061                   1
Name: GRAD_DEBT_MDN_SUPP, Length: 2038, dtype: int64

In [100]:
# to_numeric : 숫자형으로 변환
# errors = 'ignore' -> 만약 숫자로 변경할 수 없는 데이터라면 숫자로 변경하지 않고 원본 데이터를 그대로 반환합니다.
# errors = 'coerce' -> 만약 숫자로 변경할 수 없는 데이터라면 기존 데이터를 지우고 NaN으로 설정하여 반환합니다.
# errors = 'raise' -> 만약 숫자로 변경할 수 없는 데이터라면 에러를 일으키며 코드를 중단합니다.
cols = ['MD_EARN_WNE_P10', 'GRAD_DEBT_MDN_SUPP']
for col in cols:
    college[col] = pd.to_numeric(college[col], errors='coerce')

In [101]:
# float로 변경된 것을 확인
college.dtypes.loc[cols]

MD_EARN_WNE_P10       float64
GRAD_DEBT_MDN_SUPP    float64
dtype: object

In [102]:
# 최대값과 최소값을 구하기 위해 number type만 선택
college_n = college.select_dtypes('number')
college_n.head()

,HBCU,MENONLY,WOMENONLY,RELAFFIL,...,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,
Alabama A & M University,1.0,0.0,0.0,0,...,0.8284,0.1049,30300.0,33888.0
University of Alabama at Birmingham,0.0,0.0,0.0,0,...,0.5214,0.2422,39700.0,21941.5
Amridge University,0.0,0.0,0.0,1,...,0.7795,0.8540,40100.0,23370.0
University of Alabama in Huntsville,0.0,0.0,0.0,0,...,0.4596,0.2640,45500.0,24097.0
Alabama State University,1.0,0.0,0.0,0,...,0.7554,0.1270,26600.0,33118.5

In [103]:
# value가 0 또는 1만 가진 이진형식의 칼럼이 많기 때문에 제거해준다 (최대, 최소에 중요하지 않음)
binary_only = college_n.nunique() == 2
binary_only.head()

HBCU          True
MENONLY       True
WOMENONLY     True
RELAFFIL      True
SATVRMID     False
dtype: bool

In [104]:
binary_cols = binary_only[binary_only].index.tolist()
binary_cols

['HBCU', 'MENONLY', 'WOMENONLY', 'RELAFFIL', 'DISTANCEONLY', 'CURROPER']

In [105]:
college_n2 = college_n.drop(columns=binary_cols)
college_n2.head()

,SATVRMID,SATMTMID,UGDS,UGDS_WHITE,...,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,
Alabama A & M University,424.0,420.0,4206.0,0.0333,...,0.8284,0.1049,30300.0,33888.0
University of Alabama at Birmingham,570.0,565.0,11383.0,0.5922,...,0.5214,0.2422,39700.0,21941.5
Amridge University,NaN,NaN,291.0,0.2990,...,0.7795,0.8540,40100.0,23370.0
University of Alabama in Huntsville,595.0,590.0,5451.0,0.6988,...,0.4596,0.2640,45500.0,24097.0
Alabama State University,425.0,430.0,4811.0,0.0158,...,0.7554,0.1270,26600.0,33118.5

In [111]:
# idxmax : 각 열에서 최댓값을 갖는 인덱스를 찾을 수 있다.
max_cols = college_n2.idxmax()
max_cols

SATVRMID              Californ...
SATMTMID              Californ...
UGDS                  Universi...
UGDS_WHITE            Mr Leon'...
UGDS_BLACK            Velvatex...
                         ...
PCTPELL               MTI Busi...
PCTFLOAN              ABC Beau...
UG25ABV               Dongguk ...
MD_EARN_WNE_P10       Medical ...
GRAD_DEBT_MDN_SUPP    Southwes...
Length: 18, dtype: object

In [115]:
unique_max_cols = max_cols.unique()
unique_max_cols

array(['California Institute of Technology',
       'University of Phoenix-Arizona',
       "Mr Leon's School of Hair Design-Moscow",
       'Velvatex College of Beauty Culture',
       'Thunderbird School of Global Management',
       'Cosmopolitan Beauty and Tech School',
       'Haskell Indian Nations University', 'Palau Community College',
       'LIU Brentwood',
       'California University of Management and Sciences',
       'Le Cordon Bleu College of Culinary Arts-San Francisco',
       'MTI Business College Inc', 'ABC Beauty College Inc',
       'Dongguk University-Los Angeles', 'Medical College of Wisconsin',
       'Southwest University of Visual Arts-Tucson'], dtype=object)

In [113]:
# style.highlight_max() : 강조
college_n2.loc[unique_max_cols].style.highlight_max()

In [ ]:
# 위의 방식과 동일함
# pipe로 함수적용한 것만 다름

In [116]:
# 이진값을 가진 칼럼 drop
def remove_binary_cols(df):
    binary_only = df.nunique() == 2
    cols = binary_only[binary_only].index.tolist()
    return df.drop(columns=cols)

In [117]:
# 최댓값을 가진 index만 리턴
def select_rows_with_max_cols(df):
    max_cols = df.idxmax()
    unique = max_cols.unique()
    return df.loc[unique]

In [119]:
# pipe : dataframe에 함수를 적용할 때 사용
# apply : series에 함수를 적용할 때 사용
(college
   .assign(
       MD_EARN_WNE_P10=pd.to_numeric(college.MD_EARN_WNE_P10, errors='coerce'),
       GRAD_DEBT_MDN_SUPP=pd.to_numeric(college.GRAD_DEBT_MDN_SUPP, errors='coerce'))
   .select_dtypes('number')
   .pipe(remove_binary_cols)
   .pipe(select_rows_with_max_cols).style.highlight_max()
)

In [121]:
# filter로 칼럼을 걸러준다
college = pd.read_csv('college.csv', index_col='INSTNM')
college_ugds = college.filter(like='UGDS_').head()

In [123]:
college_ugds.style.highlight_max(axis='columns') # axis = 1

## 메서드 체인을 idxmax 복제

In [126]:
def remove_binary_cols(df):
    binary_only = df.nunique() == 2
    cols = binary_only[binary_only].index.tolist()
    return df.drop(columns=cols)

In [127]:
college_n = (college
   .assign(
       MD_EARN_WNE_P10=pd.to_numeric(college.MD_EARN_WNE_P10, errors='coerce'),
       GRAD_DEBT_MDN_SUPP=pd.to_numeric(college.GRAD_DEBT_MDN_SUPP, errors='coerce'))
   .select_dtypes('number')
   .pipe(remove_binary_cols)
)

In [128]:
college_n.max().head()

SATVRMID         765.0
SATMTMID         785.0
UGDS          151558.0
UGDS_WHITE         1.0
UGDS_BLACK         1.0
dtype: float64

In [129]:
college_n.eq(college_n.max()).head()

,SATVRMID,SATMTMID,UGDS,UGDS_WHITE,...,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,
Alabama A & M University,False,False,False,False,...,False,False,False,False
University of Alabama at Birmingham,False,False,False,False,...,False,False,False,False
Amridge University,False,False,False,False,...,False,False,False,False
University of Alabama in Huntsville,False,False,False,False,...,False,False,False,False
Alabama State University,False,False,False,False,...,False,False,False,False

In [ ]:
# 최댓값이 여려개인 경우, 첫번째 출현한 최댓값을 구해보자

In [152]:
# .eq = '=='연산자
#  any : 하나라도 NaN값이 있으면 False
has_row_max = (college_n
    .eq(college_n.max())
    .any(axis='columns')
)

# Nan값이 아닌 데이터 수
has_row_max.sum()

401

In [153]:
# cumsum() : 누적 합
# 여기선 True값을 누적 합
college_n.eq(college_n.max()).cumsum()

,SATVRMID,SATMTMID,UGDS,UGDS_WHITE,...,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,
Alabama A & M University,0,0,0,0,...,0,0,0,0
University of Alabama at Birmingham,0,0,0,0,...,0,0,0,0
Amridge University,0,0,0,0,...,0,0,0,0
University of Alabama in Huntsville,0,0,0,0,...,0,0,0,0
Alabama State University,0,0,0,0,...,0,0,0,0
...,...,...,...,...,...,...,...,...,...
SAE Institute of Technology San Francisco,1,1,1,109,...,55,12,1,2
Rasmussen College - Overland Park,1,1,1,109,...,55,12,1,2
National Personal Training Institute of Cleveland,1,1,1,109,...,55,12,1,2
Bay Area Medical Academy - San Jose Satellite Location,1,1,1,109,...,55,12,1,2
Excel Learning Center-San Antonio South,1,1,1,109,...,55,12,1,2

In [154]:
# 최초로 1이 등장한 경우가 처음 등장한 최댓값
(college_n
    .eq(college_n.max())
    .cumsum()
    .cumsum()
)

,SATVRMID,SATMTMID,UGDS,UGDS_WHITE,...,PCTFLOAN,UG25ABV,MD_EARN_WNE_P10,GRAD_DEBT_MDN_SUPP
INSTNM,,,,,,,,,
Alabama A & M University,0,0,0,0,...,0,0,0,0
University of Alabama at Birmingham,0,0,0,0,...,0,0,0,0
Amridge University,0,0,0,0,...,0,0,0,0
University of Alabama in Huntsville,0,0,0,0,...,0,0,0,0
Alabama State University,0,0,0,0,...,0,0,0,0
...,...,...,...,...,...,...,...,...,...
SAE Institute of Technology San Francisco,7305,7305,415,379750,...,170273,36183,3445,10266
Rasmussen College - Overland Park,7306,7306,416,379859,...,170328,36195,3446,10268
National Personal Training Institute of Cleveland,7307,7307,417,379968,...,170383,36207,3447,10270
Bay Area Medical Academy - San Jose Satellite Location,7308,7308,418,380077,...,170438,36219,3448,10272
Excel Learning Center-San Antonio South,7309,7309,419,380186,...,170493,36231,3449,10274

In [155]:
# 값이 1과 같은 데이터만 남긴다
has_row_max2 = (college_n
    .eq(college_n.max()) 
    .cumsum() 
    .cumsum() 
    .eq(1) 
    .any(axis='columns')
)

In [156]:
has_row_max2.head()

INSTNM
Alabama A & M University               False
University of Alabama at Birmingham    False
Amridge University                     False
University of Alabama in Huntsville    False
Alabama State University               False
dtype: bool

In [159]:
# index의 개수보다 많으면 잘못 프로그래밍한 것
has_row_max2.sum()

16

In [157]:
idxmax_cols = has_row_max2[has_row_max2].index
idxmax_cols

Index(['Thunderbird School of Global Management',
       'Southwest University of Visual Arts-Tucson', 'ABC Beauty College Inc',
       'Velvatex College of Beauty Culture',
       'California Institute of Technology',
       'Le Cordon Bleu College of Culinary Arts-San Francisco',
       'MTI Business College Inc', 'Dongguk University-Los Angeles',
       'Mr Leon's School of Hair Design-Moscow',
       'Haskell Indian Nations University', 'LIU Brentwood',
       'Medical College of Wisconsin', 'Palau Community College',
       'California University of Management and Sciences',
       'Cosmopolitan Beauty and Tech School', 'University of Phoenix-Arizona'],
      dtype='object', name='INSTNM')

In [161]:
# index 확인
set(college_n.idxmax().unique()) == set(idxmax_cols)

True

In [162]:
# 함수로 구현
def idx_max(df):
     has_row_max = (df
         .eq(df.max())
         .cumsum()
         .cumsum()
         .eq(1)
         .any(axis='columns')
     )
     return has_row_max[has_row_max].index

In [169]:
idx_max(college_n)

Index(['Thunderbird School of Global Management',
       'Southwest University of Visual Arts-Tucson', 'ABC Beauty College Inc',
       'Velvatex College of Beauty Culture',
       'California Institute of Technology',
       'Le Cordon Bleu College of Culinary Arts-San Francisco',
       'MTI Business College Inc', 'Dongguk University-Los Angeles',
       'Mr Leon's School of Hair Design-Moscow',
       'Haskell Indian Nations University', 'LIU Brentwood',
       'Medical College of Wisconsin', 'Palau Community College',
       'California University of Management and Sciences',
       'Cosmopolitan Beauty and Tech School', 'University of Phoenix-Arizona'],
      dtype='object', name='INSTNM')

In [164]:
# index 함수를 lambda 함수(익명 함수)로 바꿔주면 뭐가 다를까??
def idx_max(df):
     has_row_max = (df
         .eq(df.max())
         .cumsum()
         .cumsum()
         .eq(1)
         .any(axis='columns')
         [lambda df_: df_]
         .index
     )
     return has_row_max

In [170]:
%timeit college_n.idxmax().values

767 µs ± 10.8 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [171]:
%timeit idx_max(college_n)

1.31 ms ± 12 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [172]:
# 그냥 내장 매서드를 사용하자

## 열에서최대 공통 최댓값 찾기

In [173]:
college = pd.read_csv('college.csv', index_col='INSTNM')
college_ugds = college.filter(like='UGDS_')
college_ugds.head()

,UGDS_WHITE,UGDS_BLACK,UGDS_HISP,UGDS_ASIAN,...,UGDS_NHPI,UGDS_2MOR,UGDS_NRA,UGDS_UNKN
INSTNM,,,,,,,,,
Alabama A & M University,0.0333,0.9353,0.0055,0.0019,...,0.0019,0.0000,0.0059,0.0138
University of Alabama at Birmingham,0.5922,0.2600,0.0283,0.0518,...,0.0007,0.0368,0.0179,0.0100
Amridge University,0.2990,0.4192,0.0069,0.0034,...,0.0000,0.0000,0.0000,0.2715
University of Alabama in Huntsville,0.6988,0.1255,0.0382,0.0376,...,0.0002,0.0172,0.0332,0.0350
Alabama State University,0.0158,0.9208,0.0121,0.0019,...,0.0006,0.0098,0.0243,0.0137

In [174]:
highest_percentage_race = college_ugds.idxmax(axis='columns')
highest_percentage_race.head()

INSTNM
Alabama A & M University               UGDS_BLACK
University of Alabama at Birmingham    UGDS_WHITE
Amridge University                     UGDS_BLACK
University of Alabama in Huntsville    UGDS_WHITE
Alabama State University               UGDS_BLACK
dtype: object

In [181]:
# True 값의 상대 빈도 (normalize = True) 
highest_percentage_race.value_counts(normalize=True)

# 같은 것
# sum_ = highest_percentage_race.value_counts().sum()
# highest_percentage_race.value_counts().div(sum_)

UGDS_WHITE    0.670352
UGDS_BLACK    0.151586
UGDS_HISP     0.129473
UGDS_UNKN     0.023422
UGDS_ASIAN    0.012074
UGDS_AIAN     0.006110
UGDS_NRA      0.004073
UGDS_NHPI     0.001746
UGDS_2MOR     0.001164
dtype: float64

In [176]:
(college_ugds
    [highest_percentage_race == 'UGDS_BLACK']
    .drop(columns='UGDS_BLACK')
    .idxmax(axis='columns')
    .value_counts(normalize=True)
)

UGDS_WHITE    0.661228
UGDS_HISP     0.230326
UGDS_UNKN     0.071977
UGDS_NRA      0.018234
UGDS_ASIAN    0.009597
UGDS_2MOR     0.006718
UGDS_AIAN     0.000960
UGDS_NHPI     0.000960
dtype: float64